Repository: Olipro/VMG1312-B10A
Catalog: userspace/gpl/apps/sysstat/nls/*.po
Languages: sk

source: sysstat version %s
sk: sysstat verzia %s

source: Cannot open %s: %s
sk: Nie je mo¾né otvori» %s: %s

source: Cannot handle so many processors!
sk: Nie je mo¾né obslú¾i» toµko procesorov!

source: Usage: %s [ options... ] [ <interval> [ <count> ] ] Options are: [ -c ] [ -d ] [ -N ] [ -n ] [ -k | -m ] [ -t ] [ -V ] [ -x ] [ <device> [ ... ] | ALL ] [ -p [ <device> | ALL ] ]
sk: Pou¾itie: %s [ voµby... ] [ <interval> [ <poèet> ] ] Mo¾né voµby: [ -c ] [ -d ] [ -N ] [ -n ] [ -k | -m ] [ -t ] [ -V ] [ -x ] [ <zariadenie> [ ... ] | ALL ] [ -p [ <zariadenie> | ALL ] ]

source: Time: %s
sk: Èas: %s

source: -x and -p options are mutually exclusive
sk: Voµby -x a -p sa navzájom vyluèujú

source: Usage: %s [ options... ] [ <interval> [ <count> ] ] Options are: [ -P { <cpu> | ALL } ] [ -V ]
sk: Pou¾itie: %s [ voµby... ] [ <interval> [ <poèet> ] ] Mo¾né voµby: [ -P { <cpu> | ALL } ] [ -V ]

source: Average:
sk: Priemer:

source: Not that many processors!
sk: Nie a¾ tak veµa procesorov!

source: Usage: %s [ options... ] [ <interval> [ <count> ] ] Options are: [ -C <comm> ] [ -d ] [ -I ] [ -r ] [ -t ] [ -u ] [ -V ] [ -w ] [ -p { <pid> | SELF | ALL } ] [ -T { TASK | CHILD | ALL } ]
sk: Pou¾itie: %s [ voµby... ] [ <interval> [ <poèet> ] ] Mo¾né voµby: [ -C <comm> ] [ -d ] [ -I ] [ -r ] [ -t ] [ -u ] [ -V ] [ -w ] [ -p { <pid> | SELF | ALL } ] [ -T { TASK | CHILD | ALL } ]

source: Requested activities not available
sk: ®iadané ¹tatistiky nie sú dostupné

source: Error while reading system activity file: %s
sk: Chyba poèas èítania súboru aktivity systému: %s

source: End of system activity file unexpected
sk: Neoèakávaný koniec súboru aktivity systému

source: Invalid system activity file: %s (%#x)
sk: Nesprávny súbor aktivity systému: %s (%#x)

source: Requested activities not available in file
sk: ®iadané ¹tatistiky nie sú dostupné v súbore

source: Usage: %s [ options... ] [ <interval> [ <count> ] ] [ <outfile> ] Options are: [ -C <comment> ] [ -d ] [ -F ] [ -I ] [ -V ]
sk: Pou¾itie: %s [ voµby... ] [ <interval> [ <poèet> ] ] [ <výstupný_súbor> ] Mo¾né voµby: [ -C <comment> ] [ -d ] [ -F ] [ -I ] [ -V ]

source: Cannot write data to system activity file: %s
sk: Nie je mo¾né zapísa» údaje do súboru aktivity systému: %s

source: Cannot write system activity file header: %s
sk: Nie je mo¾né zapísa» hlavièku súboru aktivity systému: %s

source: Cannot append data to that file
sk: Nie je mo¾né dopísa» údaje do toho súboru

source: Usage: %s [ options... ] [ <interval> [ <count> ] ] [ <datafile> ] Options are: [ -d | -D | -H | -p | -x ] [ -t ] [ -V ] [ -P { <cpu> | ALL } ] [ -s [ <hh:mm:ss> ] ] [ -e [ <hh:mm:ss> ] ] [ -- <sar_options...> ]
sk: Pou¾itie: %s [ voµby... ] [ <interval> [ <poèet> ] ] [ <súbor> ] Mo¾né voµby: [ -d | -D | -H | -p | -x ] [ -t ] [ -V ] [ -P { <cpu> | ALL } ] [ -s [ <hh:mm:ss> ] ] [ -e [ <hh:mm:ss> ] ] [ -- <sar_voµby...> ]

source: Usage: %s [ options... ] [ <interval> [ <count> ] ] Options are: [ -A ] [ -b ] [ -B ] [ -c ] [ -C ] [ -d ] [ -i <interval> ] [ -p ] [ -q ] [ -r ] [ -R ] [ -t ] [ -u ] [ -v ] [ -V ] [ -w ] [ -W ] [ -y ] [ -I { <irq> | SUM | ALL | XALL } ] [ -P { <cpu> | ALL } ] [ -n { DEV | EDEV | NFS | NFSD | SOCK | ALL } ] [ -o [ <filename> ] | -f [ <filename> ] ] [ -s [ <hh:mm:ss> ] ] [ -e [ <hh:mm:ss> ] ]
sk: Pou¾itie: %s [ voµby... ] [ <interval> [ <poèet> ] ] Mo¾né voµby: [ -A ] [ -b ] [ -B ] [ -c ] [ -C ] [ -d ] [ -i <interval> ] [ -p ] [ -q ] [ -r ] [ -R ] [ -t ] [ -u ] [ -v ] [ -V ] [ -w ] [ -W ] [ -y ] [ -I { <irq> | SUM | ALL | XALL } ] [ -P { <cpu> | ALL } ] [ -n { DEV | EDEV | NFS | NFSD | SOCK | ALL } ] [ -o [ <súbor> ] | -f [ <súbor> ] ] [ -s [ <hh:mm:ss> ] ] [ -e [ <hh:mm:ss> ] ]

source: Not an SMP machine...
sk: Poèítaè nie je multiprocesorový...

source: Invalid data format
sk: Nesprávny formát údajov

source: -f and -o options are mutually exclusive
sk: Voµby -f a -o sa navzájom vyluèujú

source: Not reading from a system activity file (use -f option)
sk: Nie je èítané zo súboru aktivity systému (pou¾i voµbu -f)
