Repository: Olipro/VMG1312-B10A
Catalog: userspace/gpl/libs/libiconv/po/*.po
Languages: nl

source: Usage: iconv [-c] [-s] [-f fromcode] [-t tocode] [file ...]
nl: Gebruik: iconv [-c] [-s] [-f vancode] [-t naarcode] [bestand ...]

source: or: iconv -l
nl: of: iconv -l

source: Try `%s --help' for more information.
nl: Probeer `%s --help' voor meer informatie.

source: Usage: %s [OPTION...] [-f ENCODING] [-t ENCODING] [INPUTFILE...]
nl: Gebruik: %s [OPTIE...] [-f CODERING] [-t CODERING] [INVOERBESTAND...]

source: or: %s -l
nl: of: %s -l

source: Converts text from one encoding to another encoding.
nl: Zet tekst om van één codering naar een andere.

source: Options controlling the input and output format:
nl: Opties die weerslag hebben op het formaat van de in- en uitvoer:

source: -f ENCODING, --from-code=ENCODING the encoding of the input
nl: -f CODERING, --from-code=CODERING de codering van de invoer

source: -t ENCODING, --to-code=ENCODING the encoding of the output
nl: -t CODERING, --to-code=CODERING de codering van de uitvoer

source: Options controlling conversion problems:
nl: Opties die weerslag hebben op omzettingsproblemen:

source: -c discard unconvertible characters
nl: -c laat onomzetbare tekens vallen

source: --unicode-subst=FORMATSTRING substitution for unconvertible Unicode characters
nl: --unicode-subst=TEKST vervanging voor onomzetbare Unicode-tekens

source: --byte-subst=FORMATSTRING substitution for unconvertible bytes
nl: --byte-subst=TEKST vervanging voor onomzetbare bytes

source: --widechar-subst=FORMATSTRING substitution for unconvertible wide characters
nl: --widechar-subst=TEKST vervanging voor onomzetbare brede tekens

source: Options controlling error output:
nl: Opties die weerslag hebben op foutmeldingen:

source: -s, --silent suppress error messages about conversion problems
nl: -s, --silent onderdruk meldingen van omzettingsproblemen

source: Informative output:
nl: Informatieve uitvoer:

source: -l, --list list the supported encodings
nl: -l, --list toon een lijst van de ondersteunde coderingen

source: --help display this help and exit
nl: --help toon deze hulptekst en beëindig het programma

source: --version output version information and exit
nl: --version toon versie-informatie en beëindig het programma

source: Report bugs to <bug-gnu-libiconv@gnu.org>.
nl: Meld bugs aan <bug-gnu-libiconv@gnu.org>. Meld fouten in de vertaling aan <vertaling@vrijschrift.nl>.

source: Written by %s.
nl: Geschreven door %s.

source: %s argument: A format directive with a variable width is not allowed here.
nl: %s argument: Een formatteringscommando met variabele breedte is hier niet toegestaan.

source: %s argument: A format directive with a variable precision is not allowed here.
nl: %s argument: Een formatteringscommando met variabele precisie is hier niet toegestaan.

source: %s argument: A format directive with a size is not allowed here.
nl: %s argument: Een formatteringscommando met een grootte is hier niet toegestaan.

source: %s argument: The string ends in the middle of a directive.
nl: %s argument: De tekst stopt midden in een commando.

source: %s argument: The character '%c' is not a valid conversion specifier.
nl: %s argument: Het '%c' teken is geen geldige omzettingsspecificatie.

source: %s argument: The character that terminates the format directive is not a valid conversion specifier.
nl: %s argument: Het teken dat het formatteringscommando afsluit is geen geldige omzettingsspecificatie.

source: %s argument: The format string consumes more than one argument: %u argument.
nl: %s argument: De tekst verbruikt meer dan één argument: %u argument.

source: cannot convert byte substitution to Unicode: %s
nl: kan byte-vervanging niet omzetten naar Unicode: %s

source: cannot convert unicode substitution to target encoding: %s
nl: kan Unicode-vervanging niet omzetten naar de doelcodering: %s

source: cannot convert byte substitution to wide string: %s
nl: kan byte-vervanging niet omzetten naar een brede tekenreeks: %s

source: cannot convert widechar substitution to target encoding: %s
nl: kan brede tekenvervanging niet omzetten naar de doelcodering: %s

source: cannot convert byte substitution to target encoding: %s
nl: kan byte-vervanging niet omzetten naar de doelcodering: %s

source: %s:%u:%u: cannot convert
nl: %s:%u:%u: omzetting onmogelijk

source: %s:%u:%u: incomplete character or shift sequence
nl: %s:%u:%u: onvolledig teken of onvolledige shift sequence

source: %s: I/O error
nl: %s: I/O fout

source: conversion from %s unsupported
nl: omzetting vanuit %s niet ondersteund

source: conversion to %s unsupported
nl: omzetting naar %s niet ondersteund

source: conversion from %s to %s unsupported
nl: omzetting van %s naar %s niet ondersteund

source: try '%s -l' to get the list of supported encodings
nl: probeer '%s -l' om de lijst van ondersteunde coderingen te krijgen

source: I/O error
nl: I/O fout
